'use strict'
	
	/*
		Описание структуры блога:

			Блог состоит из многомерного массива:
				Arr = [Arr1, Arr2, .....];

			Каждая ячейка массива первого уровня представляют собой отдельную статью.
			
			Ячейки массива второго уровня состоят из:
				Arr1 = [
					тема статьи,
					автор статьи,
					дата статьи,
					текст статьи
				]

	*/

var blogData = [

	/*первая статья*/
	[
		/*тема*/'Устройство блога',
		/*автор*/'Андрей Лабай',
		/*дата статьи*/'13 мая 2017',
		/*текст*/`Пока еще без CSS и наведенных губ. <br> Блог создается динамически из отельно лежащего файла с расширением .js
				<br> <br> Описание структуры блога:
				<br> 


			<br> Блог состоит из многомерного массива:
				<br> Arr = [Arr1, Arr2, .....];
				<br> 

			<br> Каждая ячейка массива первого уровня представляют собой отдельную статью.
			<br> 
			
			<br> Ячейки массива второго уровня состоят из:
				<br> Arr1 = [
					<br> тема статьи,
					<br> автор статьи,
					<br> дата статьи,
					<br> текст статьи
				<br> ] 
				<br> Как-то такая задумка...`


	],

	/*вторая статья*/
	
	[
		/*тема*/'Это тема второй интересной статьи',
		/*автор*/'Эрнест Хемингуей',
		/*дата статьи*/'12 апреля 1996',
		/*текст*/'Статья про блаблабла блаблабла блаблабла блаблабла блаблабла блаблабла блаблабла блаблабла блаблабла.Текст. Очень много текста!!! Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!! Текст. Очень много текста!!! Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!! Текст. Очень много текста!!! Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!! '
	],
	
	/*третья статья*/
	
	[
		/*тема*/'А это тема уже статьи № 3',
		/*автор*/'Айзек Азимов',
		/*дата статьи*/'31 декабря 2018',
		/*текст*/'Статья про путешествия во времени и пространстве.Текст. Очень много текста!!! Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!! '
	],

	/*четвертая статья*/
	
	[
		/*тема*/'Наконец-то четвертая статья',
		/*автор*/'Алан Бадоев',
		/*дата статьи*/'18 марта 2015',
		/*текст*/'Статья про путешествия во времени и пространстве.Текст. Очень много текста!!! Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!! '
	],

	/*пятая статья*/

	[
		/*тема*/'С пылу-жару статья № 5',
		/*автор*/'Эркюль Пуаро',
		/*дата статьи*/'15 мая 1975',
		/*текст*/'Статья про путешествия во времени и пространстве.Текст. Очень много текста!!! Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!! '
	],

	/*шестая статья*/
	[
		/*тема*/'Заколючительная статья в этом примере',
		/*автор*/'Мхатма Ганди',
		/*дата статьи*/'18 ноября 1985',
		/*текст*/'Статья про путешествия во времени и пространстве.Текст. Очень много текста!!! Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!!Очень много текста!!! '
	],



];